In [1]:
import pandas as pd
df=pd.read_csv('D:\\Python\\ML\\Data.csv')
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany   NaN      NaN        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       NaN
6    Spain   NaN  52000.0        No
7   France  48.0      NaN       Yes
8  Germany  50.0  83000.0        No
9   France   NaN  67000.0       Yes

In [3]:
df.loc[0]

Country       France
Age             44.0
Salary       72000.0
Purchased         No
Name: 0, dtype: object

In [4]:
df.loc[4]

Country      Germany
Age             40.0
Salary           NaN
Purchased        Yes
Name: 4, dtype: object

In [5]:
df.loc[[0,1]]

  Country   Age   Salary Purchased
0  France  44.0  72000.0        No
1   Spain  27.0  48000.0       Yes

In [6]:
df.loc[[2,4]]

   Country   Age  Salary Purchased
2  Germany   NaN     NaN        No
4  Germany  40.0     NaN       Yes

In [7]:
df.loc[4,'Country']

'Germany'

In [8]:
df.loc[0:3,"Salary"]

0    72000.0
1    48000.0
2        NaN
3    61000.0
Name: Salary, dtype: float64

In [9]:
df.loc[0:2,'Country']

0     France
1      Spain
2    Germany
Name: Country, dtype: object

In [17]:
df.loc[[False,False,True,False,True,False,True,False,True,False]]

   Country   Age   Salary Purchased
2  Germany   NaN      NaN        No
4  Germany  40.0      NaN       Yes
6    Spain   NaN  52000.0        No
8  Germany  50.0  83000.0        No

In [21]:
df.loc[df['Age']<120,['Country']]

   Country
0   France
1    Spain
3    Spain
4  Germany
5   France
7   France
8  Germany

In [22]:
df.iloc[[0]]

  Country   Age   Salary Purchased
0  France  44.0  72000.0        No

In [23]:
df.iloc[:,0]

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [24]:
df.iloc[[0,2]]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
2  Germany   NaN      NaN        No

In [26]:
df.iloc[[True,False,True,False,True,False,True,False,True,False]]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
2  Germany   NaN      NaN        No
4  Germany  40.0      NaN       Yes
6    Spain   NaN  52000.0        No
8  Germany  50.0  83000.0        No